
clear; 
hte=30; 
hre=1.5; 
 d1=2;d2=5;
    f=300:133:1500; 
    Lb1a=69.55+26.16*log10(f)-13.82*log10(hte)-((1.111*log10(f)-0.7)*hre-1.56*log10(f)+0.8)+(44.9-6.55*log10(hte))*log10(d1); 
    Lb1b=69.55+26.16*log10(f)-13.82*log10(hte)-((1.111*log10(f)-0.7)*hre-1.56*log10(f)+0.8)+(44.9-6.55*log10(hte))*log10(d2); 
    Lb2a=69.55+26.16*log10(f)-13.82*log10(hte)-(8.29*log10(1.54*hre).^2-1.1)+(44.9-6.55*log10(hte))*log10(d1)-2*(log10(f/28)).^2-5.4; 
    Lb2b=69.55+26.16*log10(f)-13.82*log10(hte)-(8.29*log10(1.54*hre).^2-1.1)+(44.9-6.55*log10(hte))*log10(d2)-2*(log10(f/28)).^2-5.4; 
    Lb3a=69.55+26.16*log10(f)-13.82*log10(hte)-( 3.2*(log10(11.75*hre)).^2-4.97)+(44.9-6.55*log10(hte))*log10(d1)-4.78*(log10(f)).^2+18.33*log10(f)-40.98; 
    Lb3b=69.55+26.16*log10(f)-13.82*log10(hte)-( 3.2*(log10(11.75*hre)).^2-4.97)+(44.9-6.55*log10(hte))*log10(d2)-4.78*(log10(f)).^2+18.33*log10(f)-40.98; 
    figure(1); 
    hold on; 
    plot(f,Lb1a,':o'); 
    plot(f,Lb1b,'-o'); 
    plot(f,Lb2a,':*'); 
    plot(f,Lb2b,'-*'); 
    plot(f,Lb3a,':s'); 
    plot(f,Lb3b,'-s'); 

grid; 
title('姓名:褚家铭,班级学号:20142115'); 
xlabel('频率/MHz'); 
ylabel('损耗中值/dB'); 
    

